Repository: Msr7799/Atlas-AI
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Atlas AI
ar: أطلس الذكي

# settingsTitle
source: App Settings
ar: إعدادات التطبيق

source: Close
ar: إغلاق

# aiTab
source: AI
ar: الذكاء الاصطناعي

# appearanceTab
source: Appearance
ar: المظهر

# advancedTab
source: Advanced
ar: خيارات متقدمة

# aboutTab
source: About
ar: حول التطبيق

source: Theme Mode
ar: وضع المظهر

source: Primary Color
ar: 🎨 لون التطبيق الأساسي

source: Choose New Color
ar: اختيار لون جديد

# currentColor
source: Current Color: {color}
ar: اللون الحالي: {color}

source: Font Family
ar: 🔤 الخط المستخدم

source: Font Size
ar: 📏 حجم الخط

source: Small
ar: صغير

source: Large
ar: كبير

# fontSizePreview
source: Text sample with selected size ({size})
ar: نموذج للنص بالحجم المحدد ({size})

source: Custom Background
ar: 🖼️ الخلفية المخصصة

source: ✨ Current Background ✨
ar: ✨ الخلفية الحالية ✨

source: Change Background
ar: تغيير الخلفية

source: Choose Background
ar: اختيار خلفية

source: Remove Background
ar: بدون خلفية

source: Use Theme
ar: استخدام الثيم

# backgroundAppliedSuccess
source: ✅ Custom background applied successfully
ar: ✅ تم تطبيق الخلفية المخصصة بنجاح

# backgroundSelectionFailed
source: ❌ Failed to select image
ar: ❌ فشل في اختيار الصورة

# backgroundRemovedSuccess
source: 🔄 Returned to normal mode (light/dark)
ar: 🔄 تم العودة للوضع العادي (ليلي/نهاري)

source: Language
ar: 🌐 اللغة

# languageChanged
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}

# restartRequired
source: Please restart the app to apply language changes
ar: يرجى إعادة تشغيل التطبيق لتطبيق تغييرات اللغة

# welcomeMessage1
source: Welcome to Atlas AI! 🚀
ar: هلا بلي له الخافق يهلي 🚀

# welcomeMessage2
source: Your AI assistant Atlas is here to answer all your questions 🤖
ar: مساعدك أطلس يسموني ابوالعريف باجاوب جميع أسئلتك 🤖

# welcomeMessage3
source: Ask me about anything on your mind! 💭
ar: قول أسأل عن أي شي أيي في بالك؟ 💭

# welcomeMessage4
source: Tell me what's in your heart, I'm here to help! 🌟
ar: قول اللي في قلبك أنا واحد مافتن ! 🌟

# welcome
source: Welcome to Atlas AI
ar: مرحباً بك في أطلس الذكي

source: Chat with AI
ar: تحدث مع الذكاء الاصطناعي

# typeMessage
source: Type your message...
ar: اكتب رسالتك...

source: Send
ar: إرسال

source: New Chat
ar: محادثة جديدة

source: Chat History
ar: سجل المحادثات

source: Settings
ar: الإعدادات

source: Menu
ar: القائمة

source: Search
ar: البحث

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Copy
ar: نسخ

source: Share
ar: مشاركة

source: Loading...
ar: جاري التحميل...

source: Error
ar: خطأ

source: Retry
ar: إعادة المحاولة

source: Yes
ar: نعم

source: No
ar: لا

source: OK
ar: موافق

source: Programming
ar: البرمجة

source: Data Analysis
ar: تحليل البيانات

source: Translation
ar: الترجمة

source: Creative Ideas
ar: أفكار إبداعية

source: Learning
ar: التعلم

source: Help me code:
ar: أبيك تبرمج لي:

# analyzeData
source: Analyze this data:
ar: حلل هذه البيانات:

source: Translate this:
ar: ترجم هذي:

# creativeIdeasAbout
source: Give me creative ideas about:
ar: عطني افكارك وأتحفي في

source: Teach me about:
ar: أبيك تعلمني على

source: Thinking Process
ar: عملية التفكير

source: Completed
ar: مكتملة

source: In Progress
ar: جارية

# completedIn
source: Completed in {duration}
ar: اكتملت في {duration}

# revisionOfStep
source: Revision of step {step}
ar: تنقيح للخطوة {step}

source: Listening...
ar: جاري الاستماع...

# speechInitError
source: Failed to initialize speech service. Make sure to grant required permissions.
ar: فشل في تهيئة خدمة الصوت. تأكد من منح الأذونات المطلوبة.

# speechControlError
source: Error controlling voice: {error}
ar: خطأ في التحكم بالصوت: {error}

source: Web Search
ar: البحث في الويب

source: Enter search query...
ar: أدخل استعلام البحث...

# enhancingPrompt
source: Enhancing prompt with AI...
ar: جاري تحسين البرومبت باستخدام الذكاء الاصطناعي...

# listening2
source: Listening...
ar: أستمع...

# typeAnything
source: Type anything on your mind...
ar: أكتب أي شي يدور في خاطرك...

# shareYourThoughts
source: Share anything on your mind...
ar: أتحفني بأي شي يدور في خاطرك...

source: API Settings
ar: إعدادات API

source: Show Keys
ar: إظهار المفاتيح

source: Hide Keys
ar: إخفاء المفاتيح

# trainingSettings
source: Settings
ar: الإعدادات

source: Training stopped
ar: تم إيقاف التدريب

# speechServiceInitFailed
source: Failed to initialize speech service. Make sure to grant required permissions.
ar: فشل في تهيئة خدمة الصوت. تأكد من منح الأذونات المطلوبة.

# voiceControlError
source: Voice control error: {error}
ar: خطأ في التحكم بالصوت

# trainingStatus
source: Training Status: {status}
ar: حالة التدريب: {status}

# trainingProgress2
source: Progress: {progress}%
ar: التقدم: {progress}%

# epoch
source: Epoch: {current}/{total}
ar: الحقبة: {current}/{total}

source: Start Training
ar: بدء التدريب

# pauseTraining
source: Pause
ar: إيقاف مؤقت

source: Stop Training
ar: إيقاف التدريب

source: Select Model
ar: اختيار النموذج

source: Base Model
ar: النموذج الأساسي

source: Training Parameters
ar: معاملات التدريب

# learningRate
source: Learning Rate: {rate}
ar: معدل التعلم: {rate}

# batchSize
source: Batch Size: {size}
ar: حجم الدفعة: {size}

# epochs
source: Epochs: {epochs}
ar: عدد الحقب: {epochs}

source: Dataset
ar: مجموعة البيانات

source: Upload Dataset File
ar: رفع ملف البيانات

source: No file selected
ar: لم يتم اختيار ملف

# datasetInfo
source: Dataset Info: {info}
ar: معلومات البيانات: {info}

source: Overall Progress
ar: التقدم الإجمالي

source: Metrics
ar: المقاييس

source: Time Remaining
ar: الوقت المتبقي

source: Speed
ar: السرعة

# progressChart
source: Progress Chart (Coming Soon)
ar: رسم بياني للتقدم (سيتم إضافته لاحقاً)

source: Refresh
ar: تحديث

source: Clear
ar: مسح

source: Export
ar: تصدير

source: Idle
ar: في الانتظار

source: Training
ar: قيد التدريب

# errorStatus
source: Error
ar: خطأ

# pausedStatus
source: Paused
ar: متوقف مؤقتاً

# stoppedStatus
source: Stopped
ar: متوقف

source: Scroll Down
ar: التمرير للأسفل

source: Copy Selected
ar: نسخ المحدد

source: Delete Selected
ar: حذف المحدد

source: Export Selected
ar: تصدير المحدد

source: You
ar: أنت

# messagesCopied
source: Selected messages copied
ar: تم نسخ الرسائل المحددة

source: Confirm Delete
ar: تأكيد الحذف

# confirmDeleteMessages
source: Are you sure you want to delete {count} messages?
ar: هل أنت متأكد من حذف {count} رسالة؟

# messagesDeleted
source: Selected messages deleted
ar: تم حذف الرسائل المحددة

# messagesExported
source: Selected messages exported
ar: تم تصدير الرسائل المحددة

# debugModel
source: Model
ar: النموذج

# debugTemperature
source: Temperature
ar: درجة الحرارة

# debugMaxTokens
source: Max Tokens
ar: الحد الأقصى للرموز

# debugStreamResponse
source: Stream Response
ar: الاستجابة المتدفقة

# debugWebSearch
source: Web Search
ar: البحث في الويب

# debugMcpServers
source: MCP Servers
ar: خوادم MCP

# debugAutoTextFormatting
source: Auto Text Formatting
ar: المعالجة التلقائية للنص

# debugEnabled
source: Enabled
ar: مفعل

# debugDisabled
source: Disabled
ar: معطل

# debugMessageCount
source: Message Count
ar: عدد الرسائل

# debugSessionCount
source: Session Count
ar: عدد الجلسات

# debugAttachmentCount
source: Attachment Count
ar: عدد المرفقات

source: Debug Mode
ar: وضع التشخيص

# debugIsTyping
source: Is Typing
ar: يكتب الآن

# debugIsThinking
source: Is Thinking
ar: يفكر الآن

# debugYes
source: Yes
ar: نعم

# debugNo
source: No
ar: لا

# debugApiKeyStatus
source: API Key Status
ar: حالة مفاتيح API

# debugApiKeyAvailable
source: Available
ar: متوفر

# debugApiKeyNotAvailable
source: Not Available
ar: غير متوفر

# debugMcpServerStatus
source: MCP Server Status
ar: حالة خوادم MCP

# debugMemoryServer
source: Memory Server
ar: خادم الذاكرة

# debugSequentialThinking
source: Sequential Thinking
ar: التفكير التسلسلي

# debugCurrentThinking
source: Current Thinking Process
ar: عملية التفكير الحالية

# debugStepCount
source: Step Count
ar: عدد الخطوات

# debugIsComplete
source: Is Complete
ar: مكتملة

# debugStartedAt
source: Started At
ar: بدأت في

# debugCompletedAt
source: Completed At
ar: انتهت في

source: Enable MCP Servers
ar: تفعيل خوادم MCP

source: Connection Timeout
ar: مهلة الاتصال

# connectionTimeoutValue
source: 10 seconds
ar: 10 ثوان

source: Retry Attempts
ar: إعادة المحاولة

# retryAttemptsValue
source: 3 attempts
ar: 3 محاولات

source: Add Server
ar: إضافة خادم

source: Add Custom MCP Server
ar: إضافة خادم MCP مخصص

source: Advanced MCP Settings
ar: إعدادات MCP المتقدمة

# enableMcpServersSubtitle
source: Enable Model Context Protocol servers
ar: تمكين استخدام خوادم Model Context Protocol

source: Auto Retry
ar: إعادة المحاولة التلقائية

# autoRetrySubtitle
source: 3 attempts
ar: 3 محاولات

source: Connection Diagnostics
ar: تشخيص الاتصال

# connectionDiagnosticsSubtitle
source: Check MCP server status
ar: فحص حالة خوادم MCP

source: Clear Cache
ar: مسح ذاكرة التخزين المؤقت

# clearCacheSubtitle
source: Delete MCP server temporary data
ar: حذف البيانات المؤقتة لخوادم MCP

# mcpDiagnosticsTitle
source: MCP Server Diagnostics
ar: تشخيص خوادم MCP

# memoryServerStatus
source: Memory Server
ar: خادم الذاكرة

# memoryServerConnected
source: Connected and working normally
ar: متصل ويعمل بشكل طبيعي

# sequentialThinkingServerStatus
source: Sequential Thinking Server
ar: خادم التفكير التسلسلي

# sequentialThinkingConnected
source: Connected and working normally
ar: متصل ويعمل بشكل طبيعي

source: Custom Servers
ar: الخوادم المخصصة

source: No custom servers
ar: لا توجد خوادم مخصصة

# clearCacheTitle
source: Clear Cache
ar: مسح ذاكرة التخزين المؤقت

# clearCacheConfirm
source: Do you want to clear all temporary data for MCP servers?
ar: هل تريد مسح جميع البيانات المؤقتة لخوادم MCP؟

source: Cache cleared
ar: تم مسح ذاكرة التخزين المؤقت

# mcpServersTitle
source: MCP Servers
ar: خوادم MCP

# trainingServiceInitError
source: Training service initialization error
ar: خطأ في تهيئة خدمة التدريب

# advancedModelTrainingPage
source: Advanced Model Training
ar: تدريب النماذج المتقدم

source: Help
ar: مساعدة

source: Export Data
ar: تصدير البيانات

source: Initializing training service...
ar: جاري تهيئة خدمة التدريب...

# sessionType
source: Type
ar: النوع

# sessionStatus
source: Status
ar: الحالة

# sessionDate
source: Date
ar: التاريخ

source: Export Model
ar: تصدير النموذج

source: Details
ar: التفاصيل

source: Restart
ar: إعادة التشغيل

# exportModelFeatureInDevelopment
source: Model export feature is under development
ar: ميزة تصدير النموذج قيد التطوير

# sessionDetails
source: Details
ar: تفاصيل

# errorLabel
source: Error
ar: خطأ

source: Delete Training Session
ar: حذف جلسة التدريب

# deleteSessionConfirm
source: Do you want to permanently delete this session? All associated data will be deleted.
ar: هل تريد حذف هذه الجلسة نهائياً؟ سيتم حذف جميع البيانات المرتبطة بها.

# modelTrainingHelp
source: Help - Model Training
ar: مساعدة - تدريب النماذج

# trainingSettingsTitle
source: Training Settings
ar: إعدادات التدريب

# advancedTrainingSettingsInDevelopment
source: Advanced training settings are under development
ar: إعدادات التدريب المتقدمة قيد التطوير

# exportTrainingDataFeatureInDevelopment
source: Training data export feature is under development
ar: ميزة تصدير بيانات التدريب قيد التطوير

source: Active
ar: نشط

source: API Keys Status
ar: حالة مفاتيح API

source: App ready to work ✅
ar: التطبيق جاهز للعمل ✅

source: Groq key required ⚠️
ar: مفتاح Groq مطلوب ⚠️

source: Using free default keys
ar: يتم استخدام المفاتيح الافتراضية المجانية

source: Keys Details:
ar: تفاصيل المفاتيح:

source: Statistics:
ar: إحصائيات:

# availableKeys
source: Available keys: {count}/5
ar: المفاتيح المتوفرة: {count}/5

# requiredKeys
source: Required keys: {status}
ar: المفاتيح المطلوبة: {status}

# usingDefaultKeys
source: Using default keys: {status}
ar: استخدام المفاتيح الافتراضية: {status}

source: Available
ar: متوفرة

source: Missing
ar: مفقودة

source: Required
ar: مطلوب

source: Default Key
ar: مفتاح افتراضي

source: Clear API Keys
ar: مسح مفاتيح API

source: Warning
ar: تحذير

# clearKeysConfirmation
source: Do you want to clear all saved API keys? This action cannot be undone.
ar: هل تريد مسح جميع مفاتيح API المحفوظة؟ هذا الإجراء لا يمكن التراجع عنه.

# clearKeysWarning
source: • All saved keys will be cleared • Free default keys will be used • You can add your keys again anytime
ar: • سيتم مسح جميع المفاتيح المحفوظة • سيتم استخدام المفاتيح الافتراضية المجانية • يمكنك إضافة مفاتيحك مرة أخرى في أي وقت

# keysSavedSuccess
source: Keys saved successfully! ✅
ar: تم حفظ المفاتيح بنجاح! ✅

# errorSavingKeys
source: Error saving keys: {error}
ar: خطأ في حفظ المفاتيح: {error}

source: Active Model
ar: النموذج النشط

# processingImages
source: Processing {count} images...
ar: جاري معالجة {count} صورة...

# errorProcessingImages
source: Error processing images: {error}
ar: خطأ في معالجة الصور: {error}

# errorAddingImage
source: Error adding image: {error}
ar: خطأ في إضافة الصورة: {error}

# trainingHistory
source: History
ar: السجل

source: No previous training sessions
ar: لا توجد جلسات تدريب سابقة

# previousSessionsWillAppearHere
source: Previous training sessions will appear here
ar: ستظهر هنا جلسات التدريب السابقة

# trainingSessionStarted
source: Training started
ar: تم بدء التدريب

# trainingSessionStartFailed
source: Failed to start training
ar: فشل في بدء التدريب

source: Session deleted
ar: تم حذف الجلسة

# sessionDeleteFailed
source: Failed to delete session
ar: فشل في حذف الجلسة

source: Supported Training Types:
ar: أنواع التدريب المدعومة:

# fineTuning
source: • Fine-tuning: Improve existing model
ar: • Fine-tuning: تحسين نموذج موجود

# instructionTuning
source: • Instruction Tuning: Train on instructions
ar: • Instruction Tuning: تدريب على التعليمات

# conversationTuning
source: • Conversation Tuning: Train on conversations
ar: • Conversation Tuning: تدريب على المحادثات

# domainSpecific
source: • Domain Specific: Specialize in specific domain
ar: • Domain Specific: تخصص مجال معين

source: Supported File Types:
ar: أنواع الملفات المدعومة:

# txtFiles
source: • .txt - Text files (max 50MB)
ar: • .txt - ملفات نصية (حد أقصى 50MB)

# jsonFiles
source: • .json - JSON files (max 100MB)
ar: • .json - ملفات JSON (حد أقصى 100MB)

# jsonlFiles
source: • .jsonl - JSONL files (max 100MB)
ar: • .jsonl - ملفات JSONL (حد أقصى 100MB)

# csvFiles
source: • .csv - CSV files (max 25MB)
ar: • .csv - ملفات CSV (حد أقصى 25MB)

# mdFiles
source: • .md - Markdown files (max 10MB)
ar: • .md - ملفات Markdown (حد أقصى 10MB)

source: Tips:
ar: نصائح:

# useHighQualityData
source: • Use high-quality data for best results
ar: • استخدم بيانات عالية الجودة للحصول على أفضل النتائج

# startWithLowLearningRate
source: • Start with low learning rate (0.001)
ar: • ابدأ بمعدل تعلم منخفض (0.001)

# useEarlyStopping
source: • Use early stopping to avoid overfitting
ar: • استخدم الإيقاف المبكر لتجنب فرط التعلم

# monitorLogs
source: • Monitor logs to understand training progress
ar: • راقب السجلات لفهم تقدم التدريب
